//
//  WordViewModel.swift
//  control2fish
//
//  Created by Taya on 19.09.2023.
//

import Foundation

class WordViewModel: ObservableObject {
    private var words = ["Автограф", "Грабли", "Изощренный", "Органопластика", "Перессорить", "Прикрепиться", "Продернуть", "Продырявиться", "Разноситься", "Сортировщик", "Гласность", "Обувка", "Палеозойский", "Пепелище", "Покачнуться", "Предрассудок", "Румяниться", "Соблазнить", "Турецкий", "Форинт", "Диета", "Запонка", "Наколенный", "Недовольный", "Победить", "Пригонка", "Разбухнуть", "Свисток", "Ужариться", "Унимать", "Везунчик", "Великодушный", "Застегнуть", "Привертеть", "Распашонка", "Склониться", "Тол", "Трезвон", "Шашист", "Электросон", "Архивист", "Ввосьмером", "Заинька", "Закружиться", "Облезлый", "Сетчатый", "Сосватать", "Успевать", "Шаляй-валяй", "Ярем"]
    
    @Published var generatedText = ""
    init() {getRandomWords()}
    
    private func getRandomWords () {
        for i in 0..<50 {
            let randomWord = words.randomElement() ?? ""
            generatedText += i == 0 ? randomWord : " " + randomWord.lowercased()
            words.removeAll(where: { $0 == randomWord})
        }
    }
}
